'''Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.'''
s = input()

if(s=='круг'):
    a = int(input())
    print(a * a * 3.14)
elif(s=='прямоугольник'):
    a = int(input())
    b = int(input())
    print(a*b)
elif(s=='треугольник'):
    a = int(input())
    b = int(input())
    c = int(input())
    p = (a + b + c)/2
    f = ((p*(p - a)*(p - b)*(p - c)))**0.5
    print(f)